app/controllers/users_controller.rb

INSERT INTO "users" ("fullname", "nickname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
    @user	=	User.new(user_params)
    if	@user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "nickname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nickname", "sha"], ["updated_at", "2015-11-23 18:52:56.854617"], ["id", 6]]
---
    def update
        @user =	User.find_by_id(params[:id])
        if	@user.update_attributes(user_params)